In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [41]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')

In [42]:
titanic_data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [49]:
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [58]:
titanic_data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [61]:
survived_passengers=titanic_data[titanic_data.Survived==1]
surv_pass_prop=len(survived_passengers)/len(titanic_data)
surv_pass_prop

0.3838383838383838

In [64]:
titanic_data.Fare.describe(include='all')

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [69]:
m_surv=100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'male'])     #Percent of Men who Survived
w_surv=100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'female'])   #Percent of Woen who Survived
print("Male Survivor Percentage :", m_surv)
print("Female Survivor Percentage :", w_surv)

fc_surv=100*np.mean(titanic_data['Survived'][titanic_data['Pclass'] == 1])      #Percent of First Class Passengers who Survived
sc_surv=100*np.mean(titanic_data['Survived'][titanic_data['Pclass'] == 2])      #Percent of Second Class Passengers who Survived
tc_surv=100*np.mean(titanic_data['Survived'][titanic_data['Pclass'] == 3])      #Percent of Third Class Passengers who Survived
print("First Class Survivor Percentage :", fc_surv)
print("Second Class Male Survivor Percentage :", sc_surv)
print("Third Class Male Survivor Percentage :", tc_surv)

ch_surv=100*np.mean(titanic_data['Survived'][titanic_data['Age']<18])           #Percent of Children who Survived
ad_surv=100*np.mean(titanic_data['Survived'][titanic_data['Age']>=18])          #Percent of Adults who Survived
print("Child Survivor Percentage :", ch_surv)
print("Adult Survivor Percentage :", ad_surv)

Male Survivor Percentage : 18.890814558058924
Female Survivor Percentage : 74.20382165605095
First Class Survivor Percentage : 62.96296296296296
Second Class Male Survivor Percentage : 47.28260869565217
Third Class Male Survivor Percentage : 24.236252545824847
Child Survivor Percentage : 53.98230088495575
Adult Survivor Percentage : 38.10316139767055

In [70]:
survived_passengers.Embarked.value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [75]:
titanic_data.Fare.sort_values(ascending=False).head()

PassengerId
259    512.3292
738    512.3292
680    512.3292
89     263.0000
28     263.0000
Name: Fare, dtype: float64

In [82]:
len(titanic_data.Name.unique())

891